hold on
x=30:0.1:200;
y=500./x+(0.0625.*x+1.875)*1.3;
plot(x,y,'LineWidth',1.5)

x=30:0.1:200;
y=500./x+(0.0625.*x+1.875)*1.3+3;
plot(x,y,'r','LineWidth',1.5);
plot([78.4464540552736,78.4464540552736],[0,18.2],':','color','g','LineWidth',1.5)
V=[30,200,15,25];
axis(V);
plot([0,78.4464540552736],[18.18,18.18],':','color','g','LineWidth',1.5)
plot([0,78.4464540552736],[15.18,15.18],':','color','g','LineWidth',1.5)


plot([50,50],[0,16.5],':','color','g','LineWidth',1.5)
plot([0,50],[16.5,16.5],':','color','g','LineWidth',1.5)
legend('普通路段','高速路段');
title('\fontsize{14}各路段费用随速度的变化示意图')
text('18.18')